#### Ordinal categorical variables

Categorical variable which categories can be meaningfully ordered are called ordinal. For example:

    Student's grade in an exam (A, B, C or Fail).
    Days of the week can be ordinal with Monday = 1, and Sunday = 7.
    Educational level, with the categories: Elementary school, High school, College graduate, PhD ranked from 1 to 4.

When the categorical variable is ordinal, the most straightforward approach is to replace the labels by some ordinal number.

In [1]:
import pandas as pd
import numpy as np

#### Example 1

In [9]:
df = pd.DataFrame(np.arange(1,26),columns=['Student Roll Num'])
df.head()

   Student Roll Num
0                 1
1                 2
2                 3
3                 4
4                 5

In [10]:
df['Student grade'] = ['A','B','C','F','D','B','C','A','F','B',
                       'C','A','F','D','F','A','B','A','B','C',
                       'D','B','A','C','D']

In [11]:
df.head()

   Student Roll Num Student grade
0                 1             A
1                 2             B
2                 3             C
3                 4             F
4                 5             D

In [12]:
grade_map = {'A':5,
             'B':4,
             'C':3,
             'D':2,
             'F':1}

In [13]:
df['Grade_Label'] = df['Student grade'].map(grade_map)
#After the above operation we can drop 'Roll num' and 'Student Grade' columns

In [14]:
df.head()

   Student Roll Num Student grade  Grade_Label
0                 1             A            5
1                 2             B            4
2                 3             C            3
3                 4             F            1
4                 5             D            2

#### Example 2

In [15]:
import datetime

# create a variable with dates, and from that extract the weekday
# I create a list of dates with 30 days difference from today
# and then transform it into a datafame

In [20]:
base = datetime.datetime.today()
date_list =[base-datetime.timedelta(days=x) for x in range(0,30)]
df = pd.DataFrame(date_list)
df.columns = ['Day']
df.head(10)

                         Day
0 2020-02-24 13:05:33.651183
1 2020-02-23 13:05:33.651183
2 2020-02-22 13:05:33.651183
3 2020-02-21 13:05:33.651183
4 2020-02-20 13:05:33.651183
5 2020-02-19 13:05:33.651183
6 2020-02-18 13:05:33.651183
7 2020-02-17 13:05:33.651183
8 2020-02-16 13:05:33.651183
9 2020-02-15 13:05:33.651183

In [22]:
df['Day of the Week'] = df['Day'].dt.weekday_name
df.head()

                         Day Day of the Week
0 2020-02-24 13:05:33.651183          Monday
1 2020-02-23 13:05:33.651183          Sunday
2 2020-02-22 13:05:33.651183        Saturday
3 2020-02-21 13:05:33.651183          Friday
4 2020-02-20 13:05:33.651183        Thursday

In [23]:
weekday_map = {'Monday':1,
               'Tuesday':2,
               'Wednesday':3,
               'Thursday':4,
               'Friday':5,
               'Saturday':6,
               'Sunday':7
}

In [24]:
df['Day_Label'] = df['Day of the Week'].map(weekday_map)
df.head()

                         Day Day of the Week  Day_Label
0 2020-02-24 13:05:33.651183          Monday          1
1 2020-02-23 13:05:33.651183          Sunday          7
2 2020-02-22 13:05:33.651183        Saturday          6
3 2020-02-21 13:05:33.651183          Friday          5
4 2020-02-20 13:05:33.651183        Thursday          4

This notebook is prepared in referance to Krish Naik feature Engineering data material